In [1]:
import warnings
warnings.filterwarnings("ignore")

import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import numpy as np
import env

from sklearn.model_selection import train_test_split

In [2]:
import wrangle

from wrangle import wrangle_telco

from wrangle import split

In [3]:
df = wrangle_telco()

In [4]:
df.head()

  customer_id  monthly_charges  tenure  total_charges
0  0013-SMEOE           109.70      71        7904.25
1  0014-BMAQU            84.65      63        5377.80
2  0016-QLJIS            90.45      65        5957.90
3  0017-DINOC            45.20      54        2460.55
4  0017-IUDMW           116.80      72        8456.75

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1685 entries, 0 to 1694
Data columns (total 4 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   customer_id      1685 non-null   object
 1   monthly_charges  1685 non-null   float64
 2   tenure           1685 non-null   int64
 3   total_charges    1685 non-null   float64
dtypes: float64(2), int64(1), object(1)
memory usage: 65.8+ KB

In [6]:
train, validate, test = split(df)

In [7]:
train.head()

     customer_id  monthly_charges  tenure  total_charges
1096  6586-MYGKD            76.95      70        5289.80
218   1270-XKUCC            19.70      30         599.25
1067  6425-JWTDV            19.25      48         855.10
1159  6916-HIJSE            84.85      65        5459.20
1384  8173-RXAYP            19.70      24         452.55

In [8]:
train.shape

(943, 4)

In [9]:
validate.head()

     customer_id  monthly_charges  tenure  total_charges
940   5707-ZMDJP            69.70      53        3729.60
783   4827-DPADN            83.30      72        6042.70
302   1897-OKVMW            90.60      64        5817.45
1523  8990-YOZLV            66.90      69        4577.90
562   3428-MMGUB            89.55      60        5231.20

In [10]:
validate.shape

(405, 4)

In [11]:
test.head()

     customer_id  monthly_charges  tenure  total_charges
303   1904-WAJAA            64.35      24        1558.65
785   4835-YSJMR            49.80      39        1971.15
1316  7771-CFQRQ            63.80      47        3007.25
939   5702-KVQRD            82.55      71        5832.65
633   3796-ENZGF            67.25      63        4234.15

In [12]:
test.shape

(337, 4)